LinkedFolder/TrainSet60G41U3_2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          104;
        startFace       13369;
    }
    outlet
    {
        type            patch;
        nFaces          512;
        startFace       13473;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          144;
        startFace       13985;
    }
    topbottomsurface
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2502;
        startFace       14129;
    }
)

// ************************************************************************* //
